---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSATImportLinkAvailable
source: html/cbb938d6-fee4-f1b7-9d59-46a9e64ddf9b.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSATImportLinkAvailable Method

Checks whether the SAT Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsSATImportLinkAvailable()
```

## Returns
True if the SAT Import/Link functionality is available in the installed Revit.

## Remarks
SAT Import/Link is optional functionality that does not have to be part of the Revit installation.